export const items1 = [
  "مزیت شماره یک استفاده از خدمات ملومایند",
  "مزیت شماره دو استفاده از خدمات ملومایند",
  "مزیت شماره سه استفاده از خدمات ملومایند",
  "مزیت شماره چهار استفاده از خدمات ملومایند",
  "مزیت شماره پنج استفاده از خدمات ملومایند",
];

export const items2 = [
  "نتیجه شماره یک استفاده از  خدمات ملومایند",
  "نتیجه شماره دو استفاده از  خدمات ملومایند",
  "نتیجه شماره سه استفاده از  خدمات ملومایند",
  "نتیجه شماره چهار استفاده از  خدمات ملومایند",
];

export const items3 = [
  "متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
  "متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
  "متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
  "متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
  "متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
];
